In [1]:
#import dependencies
import pandas as pd

In [2]:
#File to Load 1996 t0 2019
sunshine_data_to_load = "SunShine.csv"

In [3]:
# 1. Create a DataFrame for the 201908-citibike-tripdata data. 
sunshine_data_df = pd.read_csv(sunshine_data_to_load)

#display the data table for preview
sunshine_data_df.head()

,Sector,Last Name,First Name,Salary Paid,Taxable Benefits,Employer,Job Title,Calendar Year
0,COLLEGES,Gillett,Robert,127332.0,3633.0,Algonquin College of Applied Arts and Technology,President,1996
1,COLLEGES,Hanson,Raymonde,102999.0,5557.0,Algonquin College of Applied Arts and Technology,"V.P., Academic",1996
2,COLLEGES,Killeen,Philip,183482.0,878.0,Algonquin College of Applied Arts and Technology,Past President,1996
3,COLLEGES,Mitchelson,Robert,106608.0,5586.0,Algonquin College of Applied Arts and Technology,"V.P., Finance & Administration",1996
4,COLLEGES,Crombie,Glenn,111655.0,3177.0,Cambrian College of Applied Arts & Technology,President,1996

In [7]:
sunshine_data_df.dtypes

Sector               object
Last Name            object
First Name           object
Salary Paid         float64
Taxable Benefits    float64
Employer             object
Job Title            object
Calendar Year         int64
Last_First_Name      object
dtype: object

In [11]:
#find null values
for column in sunshine_data_df.columns:
    print(f"Column {column} has {sunshine_data_df[column].isnull().sum()}null values")

Column Sector has 0null values
Column Last Name has 0null values
Column First Name has 3null values
Column Salary Paid has 0null values
Column Age has 0null values
Column Taxable Benefits has 0null values
Column Employer has 0null values
Column Job Title has 0null values
Column Calendar Year has 0null values
Column Last_First_Name has 3null values

In [12]:
#view first name row data where null

In [4]:
#Create LastName_FirstName concatenation column
sunshine_data_df["Last_First_Name"]=sunshine_data_df["Last Name"]+"_"+sunshine_data_df["First Name"]
sunshine_data_df.head()

,Sector,Last Name,First Name,Salary Paid,Taxable Benefits,Employer,Job Title,Calendar Year,Last_First_Name
0,COLLEGES,Gillett,Robert,127332.0,3633.0,Algonquin College of Applied Arts and Technology,President,1996,Gillett_Robert
1,COLLEGES,Hanson,Raymonde,102999.0,5557.0,Algonquin College of Applied Arts and Technology,"V.P., Academic",1996,Hanson_Raymonde
2,COLLEGES,Killeen,Philip,183482.0,878.0,Algonquin College of Applied Arts and Technology,Past President,1996,Killeen_Philip
3,COLLEGES,Mitchelson,Robert,106608.0,5586.0,Algonquin College of Applied Arts and Technology,"V.P., Finance & Administration",1996,Mitchelson_Robert
4,COLLEGES,Crombie,Glenn,111655.0,3177.0,Cambrian College of Applied Arts & Technology,President,1996,Crombie_Glenn

In [10]:
# Create Empty Gender, Age, City Location columns ******how do you assign datatype????*****
# sunshine_data_df.insert(4,"Age", float, allow_duplicates=False)
# sunshine_data_df.insert(2,"Gender", str, allow_duplicates=False)
sunshine_data_df.head()
sunshine_data_df.dtypes

Sector               object
Last Name            object
First Name           object
Salary Paid         float64
Age                  object
Taxable Benefits    float64
Employer             object
Job Title            object
Calendar Year         int64
Last_First_Name      object
dtype: object

In [14]:
sunshine_data_df.insert(2,"Gender", str, allow_duplicates=False)
sunshine_data_df.head()

,Sector,Last Name,Gender,First Name,Salary Paid,Age,Taxable Benefits,Employer,Job Title,Calendar Year,Last_First_Name
0,COLLEGES,Gillett,<class 'str'>,Robert,127332.0,<class 'float'>,3633.0,Algonquin College of Applied Arts and Technology,President,1996,Gillett_Robert
1,COLLEGES,Hanson,<class 'str'>,Raymonde,102999.0,<class 'float'>,5557.0,Algonquin College of Applied Arts and Technology,"V.P., Academic",1996,Hanson_Raymonde
2,COLLEGES,Killeen,<class 'str'>,Philip,183482.0,<class 'float'>,878.0,Algonquin College of Applied Arts and Technology,Past President,1996,Killeen_Philip
3,COLLEGES,Mitchelson,<class 'str'>,Robert,106608.0,<class 'float'>,5586.0,Algonquin College of Applied Arts and Technology,"V.P., Finance & Administration",1996,Mitchelson_Robert
4,COLLEGES,Crombie,<class 'str'>,Glenn,111655.0,<class 'float'>,3177.0,Cambrian College of Applied Arts & Technology,President,1996,Crombie_Glenn

In [17]:
sunshine_data_df.insert(9,"City", str, allow_duplicates=False)
sunshine_data_df.head()

,Sector,Last Name,Gender,First Name,Salary Paid,Age,Taxable Benefits,Employer,Job Title,City,Calendar Year,Last_First_Name
0,COLLEGES,Gillett,<class 'str'>,Robert,127332.0,<class 'float'>,3633.0,Algonquin College of Applied Arts and Technology,President,<class 'str'>,1996,Gillett_Robert
1,COLLEGES,Hanson,<class 'str'>,Raymonde,102999.0,<class 'float'>,5557.0,Algonquin College of Applied Arts and Technology,"V.P., Academic",<class 'str'>,1996,Hanson_Raymonde
2,COLLEGES,Killeen,<class 'str'>,Philip,183482.0,<class 'float'>,878.0,Algonquin College of Applied Arts and Technology,Past President,<class 'str'>,1996,Killeen_Philip
3,COLLEGES,Mitchelson,<class 'str'>,Robert,106608.0,<class 'float'>,5586.0,Algonquin College of Applied Arts and Technology,"V.P., Finance & Administration",<class 'str'>,1996,Mitchelson_Robert
4,COLLEGES,Crombie,<class 'str'>,Glenn,111655.0,<class 'float'>,3177.0,Cambrian College of Applied Arts & Technology,President,<class 'str'>,1996,Crombie_Glenn

In [ ]:
#Verify no duplicate entries of LastName_FirstName + year + title + employer
#need to rewrite code

print(f'Duplicate entries: {sunshine_data_df().sum()}')

In [ ]:
#Format salary to iclude $  and ,

In [1]:
sunshine_data_df.to_csv("Clean_SunShine.csv")
sunshine_data_df.head()

NameError: name 'sunshine_data_df' is not defined